print("===============程式描述========================")
print("= 程式名稱：ch2-3a.py                         =")
print("= 程式目的：計算出「每一位學生」平均成績        =")
print("==============================================")
#初始設定
Sum=[0,0,0,0]
Score = [[65, 85, 78, 75, 69 ], [66, 55, 52, 92, 47 ], [ 75, 99, 63, 73, 86 ], [ 77, 88, 99, 91, 100]];       
#處理
for i in range(0,4):                    #控制列數
    Sum[i] = 0                          #先將Sum陣列歸0 
for i in range(0,4):                  #控制列數
    for j in range(0,5):                #控制行數
       Sum[i] = Sum[i] + Score[i][j]   #計算出每一位同學的總成績
#輸出
for i in range(0,4):    #計算出每一位同學的平均成績
    print("第%d位同學的平均成績=" %(i+1),Sum[i]/5)  