print("===============程式描述========================")
print("= 程式名稱：ch2-3b.py                         =")
print("= 程式目的：計算出「每一科目」的平均分數        =")
print("==============================================")
#初始設定
Sum=[0,0,0,0,0]
Score = [[65, 85, 78, 75, 69 ], [66, 55, 52, 92, 47 ], [ 75, 99, 63, 73, 86 ], [ 77, 88, 99, 91, 100]];       
#處理
for j in range(0,5):                    #控制列數
    Sum[j] = 0                          #先將Sum陣列歸0 
for j in range(0,5):                    #控制列數
    for i in range(0,4):                #控制行數
       Sum[j] = Sum[j] + Score[i][j]    #計算出每一科目的總分數
#輸出
for j in range(0,5):    #計算出每一科目的平均分數
    print("第%d科目的平均分數=" %(j+1),Sum[j]/4)  